// Напишите программу, которая выводит случайное трехзначное число и удаляет вторую цифру этого числа.

int number = new Random().Next(100, 1000);
int num1 = number / 100;
int num2 = number % 100;
if result = num1 * 10 + num2;

Console.WriteLine(number);
Console.WriteLine(result);