// Урок 6. Массивы и строки
// Задача 2: Задайте строку, содержащую латинские буквы в обоих регистрах.
// Сформируйте строку, в которой все заглавные буквы заменены на строчные.

string line = "We aRe thE ChamPionS My FriEnD";
System.Console.WriteLine(line.ToLower());